Revit 2027 API
PointRelativeToPoint.SetHostPointReference Method
Change the host point reference.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetHostPointReference(
	Reference hostPointReference
)
Public Sub SetHostPointReference (
	hostPointReference As Reference
)
public:
void SetHostPointReference(
	Reference^ hostPointReference
)
member SetHostPointReference :
        hostPointReference : Reference -> unit
Parameters
hostPointReference Reference
Remarks
 Allowed references are to another Autodesk.Revit.DB.ReferencePoint element or to an Autodesk.Revit.DB.Point.
See Also
Reference
PointRelativeToPoint Class
Autodesk.Revit.DB Namespace